src/Documents/КАЗ_РасходныйКассовыйОрдер/КАЗ_РасходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАЗ_РасходныйКассовыйОрдер</name>
  <registerRecords>AccumulationRegister.КАЗ_ФактическиеПлатежи</registerRecords>
  <registerRecords>AccumulationRegister.КАЗ_ОстаткиСчетовИКасс</registerRecords>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.КАЗ_ЗаявкаНаОплату</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.КАЗ_КассыОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/КАЗ_ФактическиеПлатежи/КАЗ_ФактическиеПлатежи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КАЗ_ФактическиеПлатежи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.КАЗ_ЗаявкаНаОплату</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/КАЗ_ОстаткиСчетовИКасс/КАЗ_ОстаткиСчетовИКасс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КАЗ_ОстаткиСчетовИКасс</name>
  <registerType>Balance</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СчетКасса</name>
    <type>
      <types>CatalogRef.КАЗ_БанковскиеСчетаОрганизации</types>
      <types>CatalogRef.КАЗ_КассыОрганизации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/КАЗ_СтатусыЗаявки/КАЗ_СтатусыЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КАЗ_СтатусыЗаявки</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Согласована</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>ВРеестре</name>
  </enumValues>
  <enumValues>
    <name>Оплачена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

src/Documents/КАЗ_РасходныйКассовыйОрдер/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Не ЗначениеЗаполнено(Касса) Тогда
		Сообщить("Не выбрана касса.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если ПустаяСтрока(ПолучательФИО) Тогда
		Сообщить("Не указан получатель.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Сумма <= 0 Тогда
		Сообщить("Сумма РКО должна быть больше нуля.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	// Проверка остатка в кассе
	ИзмеренияОстатка = Новый Структура("СчетКасса", Касса);
	ТекущийОстаток = КазначействоПроверкаЛимитов.ПроверитьДостаточностьОстатка(
		"КАЗ_ОстаткиСчетовИКасс", "Сумма", ИзмеренияОстатка, Сумма, Дата, Отказ);

	Если Отказ Тогда
		Сообщить("Недостаточно средств в кассе. Остаток: " + Формат(ТекущийОстаток, "ЧДЦ=2"));
		Возврат;
	КонецЕсли;

	Движения.КАЗ_ФактическиеПлатежи.Записывать = Истина;
	ДвижениеПлатеж = Движения.КАЗ_ФактическиеПлатежи.Добавить();
	ДвижениеПлатеж.ВидДвижения = ВидДвиженияНакопления.Расход;
	ДвижениеПлатеж.Период = Дата;
	ДвижениеПлатеж.Заявка = Заявка;
	ДвижениеПлатеж.Сумма = Сумма;

	Движения.КАЗ_ОстаткиСчетовИКасс.Записывать = Истина;
	ДвижениеКасса = Движения.КАЗ_ОстаткиСчетовИКасс.Добавить();
	ДвижениеКасса.ВидДвижения = ВидДвиженияНакопления.Расход;
	ДвижениеКасса.Период = Дата;
	ДвижениеКасса.СчетКасса = Касса;
	ДвижениеКасса.Сумма = Сумма;

	Если ЗначениеЗаполнено(Заявка) Тогда
		ОбъектЗаявки = Заявка.ПолучитьОбъект();
		Если ОбъектЗаявки.Статус <> Перечисления.КАЗ_СтатусыЗаявки.Оплачена Тогда
			ОбъектЗаявки.Статус = Перечисления.КАЗ_СтатусыЗаявки.Оплачена;
			ОбъектЗаявки.Записать();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
